In [1]:
import pandas as pd
import numpy as np

# 1. Carga fichero

In [2]:
df_original = pd.read_csv("../Data\Raw\ds_salaries.csv")

In [3]:
df_original.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [4]:
import seaborn as sns

In [6]:
df_original["work_year"].unique()

array([2023, 2022, 2020, 2021], dtype=int64)

In [7]:
df_original["job_title"].value_counts()

Data Engineer                          1040
Data Scientist                          840
Data Analyst                            612
Machine Learning Engineer               289
Analytics Engineer                      103
                                       ...
Principal Machine Learning Engineer       1
Azure Data Engineer                       1
Manager Data Management                   1
Marketing Data Engineer                   1
Finance Data Analyst                      1
Name: job_title, Length: 93, dtype: int64

In [8]:
df_original["employee_residence"].value_counts()

US    3004
GB     167
CA      85
ES      80
IN      71
      ...
BA       1
AM       1
CY       1
KW       1
MT       1
Name: employee_residence, Length: 78, dtype: int64

In [10]:
df_original.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [12]:
df_original[df_original["employee_residence"] != df_original["company_location"]]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
81,2023,SE,FT,Machine Learning Engineer,150000,USD,150000,PT,100,US,M
82,2023,MI,FT,Applied Machine Learning Engineer,65000,EUR,69751,IN,100,DE,S
183,2020,EX,FT,Staff Data Analyst,15000,USD,15000,NG,0,CA,M
218,2023,SE,FT,Applied Data Scientist,100000,AUD,68318,AU,100,FI,M
249,2022,SE,FT,Data Scientist,84000,EUR,88256,ES,100,GB,L
...,...,...,...,...,...,...,...,...,...,...,...
3729,2021,EN,FT,AI Scientist,1335000,INR,18053,IN,100,AS,S
3731,2020,MI,FT,Data Scientist,55000,EUR,62726,FR,50,LU,S
3735,2021,EN,PT,AI Scientist,12000,USD,12000,BR,100,US,S
3743,2020,MI,FT,Data Engineer,130800,USD,130800,ES,100,US,M
3746,2021,MI,FT,Data Scientist,160000,SGD,119059,SG,100,IL,M

## Cambio usd a eur

In [13]:
tasa_cambio = 0.92

df_original["salario_eur"] = df_original["salary_in_usd"] * tasa_cambio

In [14]:
df_original

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,salario_eur
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L,78979.24
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S,27600.00
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S,23460.00
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M,161000.00
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M,110400.00
...,...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L,379040.00
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L,138920.00
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S,96600.00
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L,92000.00
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L,87091.80

In [35]:
#groupby experiencia y salarios

exp_sal = df_original.groupby('experience_level')['salario_eur'].mean().round(2)

exp_sal

experience_level
72262.581625      72262.58
96163.864000      96163.86
140806.985819    140806.99
179336.455439    179336.46
Name: salario_eur, dtype: float64

In [36]:
# Reemplazar las etiquetas por los salarios medios correspondientes
df_original['experience_level'] = df_original['experience_level'].map(exp_sal)

In [37]:
df_original

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,salario_eur
0,2023,140806.99,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L,78979.24
1,2023,96163.86,CT,ML Engineer,30000,USD,30000,US,100,US,S,27600.00
2,2023,96163.86,CT,ML Engineer,25500,USD,25500,US,100,US,S,23460.00
3,2023,140806.99,FT,Data Scientist,175000,USD,175000,CA,100,CA,M,161000.00
4,2023,140806.99,FT,Data Scientist,120000,USD,120000,CA,100,CA,M,110400.00
...,...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,140806.99,FT,Data Scientist,412000,USD,412000,US,100,US,L,379040.00
3751,2021,96163.86,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L,138920.00
3752,2020,72262.58,FT,Data Scientist,105000,USD,105000,US,100,US,S,96600.00
3753,2020,72262.58,CT,Business Data Analyst,100000,USD,100000,US,100,US,L,92000.00
3754,2021,140806.99,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L,87091.80

## 2. Creación csv train y test

In [41]:
from sklearn.model_selection import train_test_split

train_df, test_df = train_test_split(df_original, test_size=0.2, random_state=42)

In [42]:
print(test_df.shape)
print(train_df.shape)

(20000, 9)
(80000, 9)

## 3.Creación csv

In [47]:
def csv(nombre_archivo, archivo_guardar):

    ruta_archivo = '../Data/' + nombre_archivo + '.csv'
    archivo_guardar.to_csv(ruta_archivo, index=False)

In [48]:
csv("test", test_df)

In [ ]:
csv("train", train_df)